Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/netxduo-network-interface-integration/source/cy_netxduo.c
/*
 * Copyright 2021 Cypress Semiconductor Corporation
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "cy_network_mw_core.h"

#include <string.h>
#include <stdint.h>

#include "cy_netxduo_error.h"
#include "cy_wifimwcore_eapol.h"
#include "cy_result.h"
#include "cy_log.h"
#include "cy_utils.h"
#include "cybsp_wifi.h"
#include "cy_network_buffer.h"
#include "nx_api.h"
#include "nx_arp.h"
#include "nxd_dhcp_client.h"
#include "nxd_dhcp_server.h"
#include "nxd_dns.h"
#include "cy_wifimwcore_eapol.h"

#include "whd.h"
#include "whd_wifi_api.h"
#include "whd_network_types.h"
#include "whd_buffer_api.h"

/******************************************************
 *                    Constants
 ******************************************************/

#define IPv4_PACKET_TYPE                0x0800
#define IPv6_PACKET_TYPE                0x86DD
#define ARP_PACKET_TYPE                 0x0806
#define RARP_PACKET_TYPE                0x8035
#define EAPOL_PACKET_TYPE               0x888E

#define MAX_NW_INTERFACE                (2)

#define SIZE_OF_ARP_ENTRY               sizeof(NX_ARP)

#define IP_STACK_SIZE                   (2 * 1024)
#define ARP_CACHE_SIZE                  (6 * SIZE_OF_ARP_ENTRY)
#define DHCP_STACK_SIZE                 (1280)

#define DHCP_IP_ADDRESS_RESOLUTION_TIMEOUT  (10000)

#define DHCP_SERVER_MAX_NUM_CLIENTS         (10)

#define DNS_LOCAL_CACHE_SIZE                (2048)

#define MAX_LINK_LOCAL_IPV6_READY_ATTEMPTS  (10)
#define LINK_LOCAL_IPV6_ATTEMPT_INTERVAL    (500)

#define BLOCK_SIZE_ALIGNMENT                (64)
#define ARP_CACHE_CHECK_INTERVAL_IN_MSEC    (5)
#define ARP_WAIT_TIME_IN_MSEC               (30000)

/******************************************************
 *                      Macros
 ******************************************************/


#define MULTICAST_IP_TO_MAC(ip)         {   (uint8_t) 0x01,             \
                                            (uint8_t) 0x00,             \
                                            (uint8_t) 0x5e,             \
                                            (uint8_t) ((ip)[1] & 0x7F), \
                                            (uint8_t) (ip)[2],          \
                                            (uint8_t) (ip)[3]           \
                                        }


#define IP_HANDLE(interface)            (cy_nxd_ip_handle[(interface) & 3])

#define DRIVER_FOR_IF(interface)        (cy_nxd_ip_driver_entries[(interface) & 3])
#define STACK_FOR_IF(interface)         (cy_nxd_ip_stack[(interface) & 3])
#define ARP_FOR_IF(interface)           (cy_nxd_arp_cache[(interface) & 3])

#ifdef ENABLE_NETWORK_CORE_LOGS
#define wm_cy_log_msg cy_log_msg
#else
#define wm_cy_log_msg(a,b,c,...)
#endif

/******************************************************
 *               Static Function Declarations
 ******************************************************/
static void internal_ip_change_callback(NX_IP *netif, VOID *additional_info);

static void cy_sta_netxduo_driver_entry(NX_IP_DRIVER *driver);
static void cy_ap_netxduo_driver_entry(NX_IP_DRIVER *driver);

static void cy_netxduo_driver_entry(NX_IP_DRIVER *driver, whd_interface_t ifp);

static bool is_interface_added(cy_network_hw_interface_type_t iface_type);
static cy_rslt_t is_interface_valid(cy_network_interface_context *iface);
static bool is_network_up(cy_network_hw_interface_type_t iface_type);

static cy_rslt_t dhcp_client_init(cy_network_interface_context *iface, NX_PACKET_POOL *packet_pool);
static cy_rslt_t dhcp_client_deinit(void);

static cy_rslt_t dhcp_server_init(cy_network_interface_context *iface, NX_PACKET_POOL *packet_pool);
static cy_rslt_t dhcp_server_deinit(void);

static cy_rslt_t dns_client_init(cy_network_interface_context *iface, NX_PACKET_POOL *packet_pool);
static cy_rslt_t dns_client_deinit(void);

static cy_rslt_t cy_netxduo_add_dns_server(cy_network_hw_interface_type_t iface_type, NXD_ADDRESS *dns_server_addr);
/******************************************************
 *               Variable Definitions
 ******************************************************/

static NX_IP            wifi_sta_ip_handle;
static char             wifi_sta_ip_stack[IP_STACK_SIZE];
static char             wifi_sta_arp_cache[ARP_CACHE_SIZE];
static NX_DHCP          wifi_sta_dhcp_handle;
static bool             wifi_sta_dhcp_needed;
static NX_DNS           wifi_sta_dns_handle;

#ifdef NX_DNS_CACHE_ENABLE
static UCHAR            wifi_sta_dns_local_cache[DNS_LOCAL_CACHE_SIZE];
#endif

static NX_IP            wifi_ap_ip_handle;
static char             wifi_ap_ip_stack[IP_STACK_SIZE];
static char             wifi_ap_arp_cache[ARP_CACHE_SIZE];
static NX_DHCP_SERVER   wifi_ap_dhcp_handle;
static char             wifi_ap_dhcp_stack[NX_DHCP_SERVER_THREAD_STACK_SIZE];

static NX_IP *cy_nxd_ip_handle[MAX_NW_INTERFACE] =
{
    [CY_NETWORK_WIFI_STA_INTERFACE] =  &wifi_sta_ip_handle,
    [CY_NETWORK_WIFI_AP_INTERFACE]  =  &wifi_ap_ip_handle
};

/* IP interface whd iface status */
whd_interface_t ip_networking_whd_iface[MAX_NW_INTERFACE];
#define SET_IP_NETWORK_WHD_IFACE(interface, iface)  (ip_networking_whd_iface[(interface)&3] = iface)
#define GET_IP_NETWORK_WHD_IFACE(interface)         (ip_networking_whd_iface[(interface)&3])

/* IP UP status */
bool ip_up[MAX_NW_INTERFACE];
#define SET_IP_UP(interface, status)               (ip_up[(interface)&3] = status)

static cy_network_activity_event_callback_t activity_callback;
static cy_wifimwcore_eapol_packet_handler_t internal_eapol_packet_handler;
static cy_network_ip_change_callback_t ip_change_callback;

static void (* const cy_nxd_ip_driver_entries[MAX_NW_INTERFACE])(struct NX_IP_DRIVER_STRUCT *) =
{
    [CY_NETWORK_WIFI_STA_INTERFACE] = cy_sta_netxduo_driver_entry,
    [CY_NETWORK_WIFI_AP_INTERFACE]  = cy_ap_netxduo_driver_entry
};

