Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/netxduo-network-interface-integration/source/cy_netxduo.c
/* Network objects */
static char *cy_nxd_ip_stack[MAX_NW_INTERFACE] =
{
    [CY_NETWORK_WIFI_STA_INTERFACE] = wifi_sta_ip_stack,
    [CY_NETWORK_WIFI_AP_INTERFACE]  = wifi_ap_ip_stack,
};

static char *cy_nxd_arp_cache[MAX_NW_INTERFACE] =
{
    [CY_NETWORK_WIFI_STA_INTERFACE] = wifi_sta_arp_cache,
    [CY_NETWORK_WIFI_AP_INTERFACE]  = wifi_ap_arp_cache,
};


#define NUM_PACKET_POOLS 2

#ifndef TX_PACKET_POOL_SIZE
#define TX_PACKET_POOL_SIZE         (24)
#endif

#ifndef RX_PACKET_POOL_SIZE
#define RX_PACKET_POOL_SIZE         (24)
#endif

#define APP_TX_BUFFER_POOL_SIZE     ((WHD_LINK_MTU + sizeof(NX_PACKET) + 1) * (TX_PACKET_POOL_SIZE))
#define APP_RX_BUFFER_POOL_SIZE     ((WHD_LINK_MTU + BLOCK_SIZE_ALIGNMENT + sizeof(NX_PACKET) + 1) * (RX_PACKET_POOL_SIZE))

#define TX_PACKET_POOL              (0)
#define RX_PACKET_POOL              (1)

static NX_PACKET_POOL whd_packet_pools[NUM_PACKET_POOLS];  /* 0=TX/COM, 1=RX/Default */
static uint8_t tx_buffer_pool_memory[APP_TX_BUFFER_POOL_SIZE];
static uint8_t rx_buffer_pool_memory[APP_RX_BUFFER_POOL_SIZE];

/******************************************************
 *               Function Definitions
 ******************************************************/
cy_rslt_t cy_network_init(void)
{
    wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_network_init\n");

    // Initialize NetXDuo.
    nx_system_initialize();

    /*
     * Create the TX and RX packet pools.
     * Do we need to worry about aligning the memory for better performance?
     */

    if ((nx_packet_pool_create(&whd_packet_pools[TX_PACKET_POOL], "", WHD_LINK_MTU, tx_buffer_pool_memory, sizeof(tx_buffer_pool_memory))  != NX_SUCCESS) ||
        (nx_packet_pool_create(&whd_packet_pools[RX_PACKET_POOL], "", WHD_LINK_MTU+BLOCK_SIZE_ALIGNMENT, rx_buffer_pool_memory, sizeof(rx_buffer_pool_memory))  != NX_SUCCESS))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "TX/RX pkt pool fail\n");
        return CY_RSLT_TCPIP_ERROR;
    }

    cy_buffer_pool_init(&whd_packet_pools[TX_PACKET_POOL], &whd_packet_pools[RX_PACKET_POOL]);
    return CY_RSLT_SUCCESS;
}

static VOID cy_sta_netxduo_driver_entry(NX_IP_DRIVER *driver)
{
    cy_netxduo_driver_entry(driver, GET_IP_NETWORK_WHD_IFACE(CY_NETWORK_WIFI_STA_INTERFACE));
}

static VOID cy_ap_netxduo_driver_entry(NX_IP_DRIVER *driver)
{
    cy_netxduo_driver_entry(driver, GET_IP_NETWORK_WHD_IFACE(CY_NETWORK_WIFI_AP_INTERFACE));
}

void *cy_network_get_nw_interface(cy_network_hw_interface_type_t iface_type, uint8_t iface_idx)
{
    if ((iface_type != CY_NETWORK_WIFI_STA_INTERFACE) && (iface_type != CY_NETWORK_WIFI_AP_INTERFACE))
    {
        return NULL;
    }
    if (!is_interface_added(iface_type))
    {
        return NULL;
    }
    return (IP_HANDLE(iface_type));
}

/*
 * This function takes packets from the radio driver and passes them into the
 * NetXDuo stack.  If the stack is not initialized, or if the NetXDuo stack does not
 * accept the packet, the packet is freed (dropped). If packet is of type EAPOL
 * and if EAPOL handler is registered, packet will be redirected to registered
 * handler and should be freed by EAPOL handler.
 */
void cy_network_process_ethernet_data(whd_interface_t interface, whd_buffer_t buffer)
{
    NX_PACKET     *packet_ptr = (NX_PACKET *)buffer;
    unsigned char *data       = packet_ptr->nx_packet_prepend_ptr;
    USHORT         ethertype;
    NX_IP         *net_interface = NULL;

    if (interface)
    {
        if (interface->role == WHD_STA_ROLE)
        {
            net_interface = IP_HANDLE(CY_NETWORK_WIFI_STA_INTERFACE);
        }
        else if (interface->role == WHD_AP_ROLE)
        {
            net_interface = IP_HANDLE(CY_NETWORK_WIFI_AP_INTERFACE);
        }
    }

    if (net_interface == NULL || net_interface->nx_ip_id != NX_IP_ID)
    {
        cy_buffer_release(buffer, WHD_NETWORK_RX);
        return;
    }

    ethertype = (uint16_t)(data[12] << 8 | data[13]);
    if (ethertype == EAPOL_PACKET_TYPE)
    {
        if (internal_eapol_packet_handler != NULL)
        {
            internal_eapol_packet_handler(interface, buffer);
        }
        else
        {
            cy_buffer_release(buffer, WHD_NETWORK_RX);
        }
    }
    else
    {
        /* Call activity handler which is registered with argument as false
         * indicating there is RX packet
         */
        if (activity_callback)
        {
            activity_callback(false);
        }

        /* Remove the ethernet header, so packet is ready for reading by NetXDuo */
        packet_ptr->nx_packet_prepend_ptr = packet_ptr->nx_packet_prepend_ptr + WHD_ETHERNET_SIZE;
        packet_ptr->nx_packet_length      = packet_ptr->nx_packet_length - WHD_ETHERNET_SIZE;

        if ((ethertype == IPv4_PACKET_TYPE) || ethertype == IPv6_PACKET_TYPE)
        {
#ifdef NX_DIRECT_ISR_CALL
            _nx_ip_packet_receive(net_interface, packet_ptr);
#else
            _nx_ip_packet_deferred_receive(net_interface, packet_ptr);
#endif
        }
        else if (ethertype == ARP_PACKET_TYPE)
        {
            _nx_arp_packet_deferred_receive(net_interface, packet_ptr);
        }
        else if (ethertype == RARP_PACKET_TYPE)
        {
            _nx_rarp_packet_deferred_receive(net_interface, packet_ptr);
        }
        else
        {
            /* Unknown ethertype - just release the packet */
            cy_buffer_release(buffer, WHD_NETWORK_RX);
        }
    }
}

static void cy_netxduo_multicast_driver_request_to_address(NX_IP_DRIVER *driver, whd_mac_t *mac)
{
    mac->octet[0] = (uint8_t) ((driver->nx_ip_driver_physical_address_msw & 0x0000ff00) >> 8);
    mac->octet[1] = (uint8_t) ((driver->nx_ip_driver_physical_address_msw & 0x000000ff) >> 0);
    mac->octet[2] = (uint8_t) ((driver->nx_ip_driver_physical_address_lsw & 0xff000000) >> 24);
    mac->octet[3] = (uint8_t) ((driver->nx_ip_driver_physical_address_lsw & 0x00ff0000) >> 16);
    mac->octet[4] = (uint8_t) ((driver->nx_ip_driver_physical_address_lsw & 0x0000ff00) >> 8);
    mac->octet[5] = (uint8_t) ((driver->nx_ip_driver_physical_address_lsw & 0x000000ff) >> 0);
}

