Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/netxduo-network-interface-integration/source/cy_netxduo.c
static void cy_netxduo_add_ethernet_header(NX_IP *ip_ptr_in, NX_PACKET *packet_ptr, ULONG destination_mac_msw, ULONG destination_mac_lsw, USHORT ethertype)
{
    ULONG *ethernet_header;

    /* Make space at the front of the packet buffer for the ethernet header */
    packet_ptr->nx_packet_prepend_ptr = packet_ptr->nx_packet_prepend_ptr - WHD_ETHERNET_SIZE;
    packet_ptr->nx_packet_length = packet_ptr->nx_packet_length + WHD_ETHERNET_SIZE;

    /* Ensure ethernet header writing starts with 32 bit alignment */
    ethernet_header = (ULONG *)(packet_ptr->nx_packet_prepend_ptr - 2);

    *ethernet_header = destination_mac_msw;
    *(ethernet_header + 1) = destination_mac_lsw;
    *(ethernet_header + 2) = (ip_ptr_in->nx_ip_arp_physical_address_msw << 16) | (ip_ptr_in->nx_ip_arp_physical_address_lsw >> 16);
    *(ethernet_header + 3) = (ip_ptr_in->nx_ip_arp_physical_address_lsw << 16) | ethertype;

    NX_CHANGE_ULONG_ENDIAN(*(ethernet_header));
    NX_CHANGE_ULONG_ENDIAN(*(ethernet_header+1));
    NX_CHANGE_ULONG_ENDIAN(*(ethernet_header+2));
    NX_CHANGE_ULONG_ENDIAN(*(ethernet_header+3));
}

/*
 * This function takes packets from the NetXDuo stack and sends them down to the radio.
 * If the radio is not ready, we return and error, otherwise we add a reference to
 * the packet for the radio driver and send the packet to the radio driver.  The radio
 * driver puts the packet into a send queue and will send based on another thread.  This
 * other thread will release the packet reference once the packet is actually sent.
 */
static void cy_netxduo_driver_entry(NX_IP_DRIVER *driver, whd_interface_t ifp)
{
    NX_PACKET *packet_ptr;
    whd_mac_t mac;
    NX_IP *ip;

    CY_ASSERT(driver != NULL);

    packet_ptr = driver->nx_ip_driver_packet;

    driver->nx_ip_driver_status = NX_NOT_SUCCESSFUL;

    /* Save the IP instance pointer so that the receive function will know where to send data */
    ip = driver->nx_ip_driver_ptr;

    /* Process commands which are valid independent of the link state */
    switch (driver->nx_ip_driver_command)
    {
        case NX_LINK_INITIALIZE:
            ip->nx_ip_driver_mtu            = (ULONG) WHD_PAYLOAD_MTU;
            ip->nx_ip_driver_mapping_needed = (UINT) NX_TRUE;
            driver->nx_ip_driver_status     = (UINT) NX_SUCCESS;
            break;

        case NX_LINK_UNINITIALIZE:
            return;

        case NX_LINK_ENABLE:
            if (whd_wifi_get_mac_address(ifp, &mac) != WHD_SUCCESS)
            {
                ip->nx_ip_driver_link_up = NX_FALSE;
                break;
            }

            ip->nx_ip_arp_physical_address_msw = (ULONG) ((mac.octet[0] << 8) + mac.octet[1]);
            ip->nx_ip_arp_physical_address_lsw = (ULONG) ((mac.octet[2] << 24) + (mac.octet[3] << 16) + (mac.octet[4] << 8) + mac.octet[5]);

            ip->nx_ip_driver_link_up    = (UINT) NX_TRUE;
            driver->nx_ip_driver_status = (UINT) NX_SUCCESS;
            break;

        case NX_LINK_DISABLE:
            ip->nx_ip_driver_link_up    = NX_FALSE;
            driver->nx_ip_driver_status = (UINT) NX_SUCCESS;
            break;

        case NX_LINK_MULTICAST_JOIN:
            cy_netxduo_multicast_driver_request_to_address(driver, &mac);

            if (whd_wifi_register_multicast_address(ifp, &mac) != WHD_SUCCESS)
            {
                driver->nx_ip_driver_status = (UINT) NX_NOT_SUCCESSFUL;
            }
            driver->nx_ip_driver_status = (UINT) NX_SUCCESS;
            break;

        case NX_LINK_MULTICAST_LEAVE:
            cy_netxduo_multicast_driver_request_to_address(driver, &mac);

            if (whd_wifi_unregister_multicast_address(ifp, &mac) != WHD_SUCCESS)
            {
                driver->nx_ip_driver_status = (UINT) NX_NOT_SUCCESSFUL;
            }
            driver->nx_ip_driver_status = (UINT) NX_SUCCESS;
            break;

        case NX_LINK_GET_STATUS:
            /* Signal status through return pointer */
            *(driver->nx_ip_driver_return_ptr) = (ULONG) ip->nx_ip_driver_link_up;
            driver->nx_ip_driver_status = (UINT) NX_SUCCESS;
            break;

        case NX_LINK_PACKET_SEND:
        case NX_LINK_ARP_RESPONSE_SEND:
        case NX_LINK_ARP_SEND:
        case NX_LINK_RARP_SEND:
        case NX_LINK_PACKET_BROADCAST:
            /* These cases require the link to be up, and will be processed below if it is up. */
            break;

        case NX_LINK_DEFERRED_PROCESSING:
        default:
            /* Invalid driver request */
            driver->nx_ip_driver_status = (UINT) NX_UNHANDLED_COMMAND;
            break;
    }

    /* Check if the link is up */
    if ((ip->nx_ip_driver_link_up == NX_TRUE) && (whd_wifi_is_ready_to_transceive(ifp) == WHD_SUCCESS))
    {
        switch (driver->nx_ip_driver_command)
        {
            case NX_LINK_PACKET_SEND:
                if (packet_ptr->nx_packet_ip_version == NX_IP_VERSION_V4)
                {
                    cy_netxduo_add_ethernet_header(ip, packet_ptr, driver->nx_ip_driver_physical_address_msw, driver->nx_ip_driver_physical_address_lsw, (USHORT) WHD_ETHERTYPE_IPv4);
                }
                else if (packet_ptr->nx_packet_ip_version == NX_IP_VERSION_V6)
                {
                    cy_netxduo_add_ethernet_header(ip, packet_ptr, driver->nx_ip_driver_physical_address_msw, driver->nx_ip_driver_physical_address_lsw, (USHORT) WHD_ETHERTYPE_IPv6);
                }
                else
                {
                    whd_assert("Bad packet IP version", 0 != 0);
                    nx_packet_release(packet_ptr);
                    break;
                }
                whd_network_send_ethernet_data(ifp, (whd_buffer_t)packet_ptr);
                driver->nx_ip_driver_status = (UINT) NX_SUCCESS;
                break;

            case NX_LINK_ARP_RESPONSE_SEND:
                cy_netxduo_add_ethernet_header(ip, packet_ptr, driver->nx_ip_driver_physical_address_msw, driver->nx_ip_driver_physical_address_lsw, (USHORT) WHD_ETHERTYPE_ARP);
                whd_network_send_ethernet_data(ifp, (whd_buffer_t)packet_ptr);
                driver->nx_ip_driver_status = (UINT) NX_SUCCESS;
                break;

            case NX_LINK_ARP_SEND:
                cy_netxduo_add_ethernet_header(ip, packet_ptr, (ULONG) 0xFFFF, (ULONG) 0xFFFFFFFF, (USHORT) WHD_ETHERTYPE_ARP);
                whd_network_send_ethernet_data(ifp, (whd_buffer_t)packet_ptr);
                driver->nx_ip_driver_status = (UINT) NX_SUCCESS;
                break;

