Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/netxduo-network-interface-integration/source/cy_netxduo.c
            case NX_LINK_RARP_SEND:
                cy_netxduo_add_ethernet_header(ip, packet_ptr, (ULONG) 0xFFFF, (ULONG) 0xFFFFFFFF, (USHORT) WHD_ETHERTYPE_RARP);
                whd_network_send_ethernet_data(ifp, (whd_buffer_t)packet_ptr);
                driver->nx_ip_driver_status = (UINT) NX_SUCCESS;
                break;

            case NX_LINK_PACKET_BROADCAST:
                if (packet_ptr->nx_packet_ip_version == NX_IP_VERSION_V4)
                {
                    cy_netxduo_add_ethernet_header(ip, packet_ptr, (ULONG) 0xFFFF, (ULONG) 0xFFFFFFFF, (USHORT) WHD_ETHERTYPE_IPv4);
                }
                else if (packet_ptr->nx_packet_ip_version == NX_IP_VERSION_V6)
                {
                    cy_netxduo_add_ethernet_header(ip, packet_ptr, (ULONG) 0xFFFF, (ULONG) 0xFFFFFFFF, (USHORT) WHD_ETHERTYPE_IPv6);
                }
                else
                {
                    whd_assert("Bad packet IP version", 0 != 0);
                    nx_packet_release(packet_ptr);
                    break;
                }
                whd_network_send_ethernet_data(ifp, (whd_buffer_t)packet_ptr);
                driver->nx_ip_driver_status = (UINT) NX_SUCCESS;
                break;

            case NX_LINK_INITIALIZE:
            case NX_LINK_ENABLE:
            case NX_LINK_DISABLE:
            case NX_LINK_MULTICAST_JOIN:
            case NX_LINK_MULTICAST_LEAVE:
            case NX_LINK_GET_STATUS:
            case NX_LINK_DEFERRED_PROCESSING:
            default:
                /* Handled in above case statement */
                break;
        }
    }
    else
    {
        /* Link is down, free any packet provided by the command */
        if (packet_ptr != NULL)
        {
            switch (driver->nx_ip_driver_command)
            {
                case NX_LINK_PACKET_BROADCAST:
                case NX_LINK_RARP_SEND:
                case NX_LINK_ARP_SEND:
                case NX_LINK_ARP_RESPONSE_SEND:
                case NX_LINK_PACKET_SEND:
                    nx_packet_release(packet_ptr);
                    break;

                default:
                    break;
            }
        }
    }
}

/*
 * This is the main entry point in this file.  This function takes a WHD radio driver
 * handle and and optional static IP address, and adds interface to NetXDuo.
 * Note: static IP address is optional for STA interface.
 */
cy_rslt_t cy_network_add_nw_interface(cy_network_hw_interface_type_t iface_type, uint8_t iface_idx, void *hw_interface, uint8_t *mac_address,
                                      cy_network_static_ip_addr_t *static_ipaddr, cy_network_interface_context **iface_context)
{
    UINT  status;
    ULONG ip_addr;
    ULONG netmask;

    /* Currently only WIFI Interface is supported */
    if (((iface_type != CY_NETWORK_WIFI_STA_INTERFACE) && (iface_type != CY_NETWORK_WIFI_AP_INTERFACE)) || iface_context == NULL)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }
    /* static IP addr is mandatory for AP */
    if ((iface_type == CY_NETWORK_WIFI_AP_INTERFACE) && (static_ipaddr == NULL))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error static IP addr cannot be NULL for AP interface\n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    if (is_interface_added(iface_type))
    {
        return CY_RSLT_SUCCESS;
    }

    /* Allocate memory for interface context */
    *iface_context =  calloc(sizeof(cy_network_interface_context), 1);
    if (*iface_context == NULL)
    {
        return CY_RSLT_NETWORK_ERROR_ADDING_INTERFACE;
    }
    /*
     * Set the WHD interface for the network role.
     */

    SET_IP_NETWORK_WHD_IFACE(iface_type, (whd_interface_t)hw_interface);

    /* Assign the IP address if static, otherwise, zero the IP address */
    if (static_ipaddr == NULL)
    {
        ip_addr = 0;
        netmask = 0xFFFFF000UL;
    }
    else
    {
        ip_addr = ntohl(static_ipaddr->addr.ip.v4);
        netmask = ntohl(static_ipaddr->netmask.ip.v4);
    }
    status = nx_ip_create(IP_HANDLE(iface_type), (char*)"NetXDuo IP", ip_addr, netmask,
                          &whd_packet_pools[TX_PACKET_POOL], DRIVER_FOR_IF(iface_type),
                          STACK_FOR_IF(iface_type), IP_STACK_SIZE, 2);

    if (status != NX_SUCCESS)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error adding interface\n");
        SET_IP_NETWORK_WHD_IFACE(iface_type, NULL);
        return CY_RSLT_NETWORK_ERROR_ADDING_INTERFACE;
    }

    if (iface_type == CY_NETWORK_WIFI_STA_INTERFACE && static_ipaddr == NULL)
    {
        wifi_sta_dhcp_needed = true;
    }

    if (!wifi_sta_dhcp_needed)
    {
        nx_ip_gateway_address_set(IP_HANDLE(iface_type), ntohl(static_ipaddr->gateway.ip.v4));
    }

    (*iface_context)->iface_type = iface_type;
    (*iface_context)->iface_idx = iface_idx;
    (*iface_context)->nw_interface = IP_HANDLE(iface_type);
    (*iface_context)->is_initialized = true;

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_network_remove_nw_interface(cy_network_interface_context *iface_context)
{
    NX_IP *ip_ptr = IP_HANDLE(iface_context->iface_type);

    if (is_interface_valid(iface_context) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    /* Interface can be removed only if the interface was previously added and network is down */
    if (!is_interface_added(iface_context->iface_type))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error Interface doesn't exist\n");
        return CY_RSLT_NETWORK_INTERFACE_DOES_NOT_EXIST;
    }

    if (is_network_up(iface_context->iface_type))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error removing interface, bring down the network before removing the interface\n");
        return CY_RSLT_NETWORK_ERROR_REMOVING_INTERFACE;
    }

    /* Delete the network interface */
    if (ip_ptr->nx_ip_id == NX_IP_ID)
    {
        if (nx_ip_delete(IP_HANDLE(iface_context->iface_type)) != NX_SUCCESS)
        {
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Could not delete IP instance\n");
            return CY_RSLT_NETWORK_ERROR_REMOVING_INTERFACE;
        }
        memset(ip_ptr, 0, sizeof(NX_IP));
    }

    if (iface_context->iface_type == CY_NETWORK_WIFI_STA_INTERFACE)
    {
        wifi_sta_dhcp_needed = false;
    }

    SET_IP_NETWORK_WHD_IFACE(iface_context->iface_type, NULL);

    memset(iface_context, 0, sizeof(cy_network_interface_context));

    free(iface_context);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_netxduo_autoipv6(cy_network_interface_context *iface_context)
{
    UINT        ipv6_address_index;
    UINT        ipv6_interface_index;
    ULONG       ipv6_prefix;
    NXD_ADDRESS ipv6_address;
    uint8_t     ipv6_address_attempt = 0;

