Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/netxduo-network-interface-integration/source/cy_netxduo.c
    /* Set the IPv6 linklocal address using our MAC */
    wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Setting IPv6 link-local address\n");

    nxd_ipv6_address_delete(IP_HANDLE(iface_context->iface_type), 0);
    nxd_ipv6_enable(IP_HANDLE(iface_context->iface_type));
    nxd_ipv6_address_set(IP_HANDLE(iface_context->iface_type), CY_NETWORK_PRIMARY_INTERFACE, NX_NULL, 10, &ipv6_address_index);

    /* Wait until the link-local address is properly advertised using network solicitation frame
     * and nobody on the local network complains.
     * If the address is not valid after MAX_LINK_LOCAL_IPV6_READY_ATTEMPS disable ipv6 */

    do
    {
        if (IP_HANDLE(iface_context->iface_type)->nx_ipv6_address[ipv6_address_index].nxd_ipv6_address_state == NX_IPV6_ADDR_STATE_VALID)
        {
#ifdef ENABLE_NETWORK_CORE_LOGS
            uint16_t *ipv6 = (uint16_t *)ipv6_address.nxd_ip_address.v6;
#endif
            nxd_ipv6_address_get(IP_HANDLE(iface_context->iface_type), ipv6_address_index, &ipv6_address, &ipv6_prefix, &ipv6_interface_index);
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPv6 network ready IP: %.4X:%.4X:%.4X:%.4X:%.4X:%.4X:%.4X:%.4X\n",
                          (unsigned int)(ipv6[1]), (unsigned int)(ipv6[0]), (unsigned int)(ipv6[3]),
                          (unsigned int)(ipv6[2]), (unsigned int)(ipv6[5]), (unsigned int)(ipv6[4]),
                          (unsigned int)(ipv6[7]), (unsigned int)(ipv6[6]));
            break;
        }
        cy_rtos_delay_milliseconds(LINK_LOCAL_IPV6_ATTEMPT_INTERVAL);
        ipv6_address_attempt++;

    } while (ipv6_address_attempt < MAX_LINK_LOCAL_IPV6_READY_ATTEMPTS);

    if (IP_HANDLE(iface_context->iface_type)->nx_ipv6_address[ipv6_address_index].nxd_ipv6_address_state != NX_IPV6_ADDR_STATE_VALID)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPv6 network is not ready\n");
        nxd_ipv6_disable(IP_HANDLE(iface_context->iface_type));
        return CY_RSLT_TCPIP_ERROR;
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_network_ip_up(cy_network_interface_context *iface_context)
{
    UINT status;
    UINT res;

    if (is_interface_valid(iface_context) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    if (is_network_up(iface_context->iface_type))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Network is already up\n");
        return CY_RSLT_SUCCESS;
    }

    if ((res = nx_arp_enable(IP_HANDLE(iface_context->iface_type), ARP_FOR_IF(iface_context->iface_type), ARP_CACHE_SIZE)) != NX_SUCCESS)
    {
        if (NX_ALREADY_ENABLED != res)
        {
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "error enable arp: %d\n", res);
            return CY_RSLT_TCPIP_ERROR;
        }
    }

    if ((res = nx_tcp_enable(IP_HANDLE(iface_context->iface_type))) != NX_SUCCESS)
    {
        if (NX_ALREADY_ENABLED != res)
        {
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "error enable tcp: %d\n", res);
            return CY_RSLT_TCPIP_ERROR;
        }
    }

    if ((res = nx_udp_enable(IP_HANDLE(iface_context->iface_type))) != NX_SUCCESS)
    {
        if (NX_ALREADY_ENABLED != res)
        {
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "error enable udp: %d\n", res);
            return CY_RSLT_TCPIP_ERROR;
        }
    }

    if ((res = nxd_icmp_enable(IP_HANDLE(iface_context->iface_type))) != NX_SUCCESS)
    {
        if (NX_ALREADY_ENABLED != res)
        {
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "error enable icmp: %d\n", res);
            return CY_RSLT_TCPIP_ERROR;
        }
    }

    if ((res = nx_igmp_enable(IP_HANDLE(iface_context->iface_type))) != NX_SUCCESS)
    {
        if (NX_ALREADY_ENABLED != res)
        {
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "error enable igmp: %d\n", res);
            return CY_RSLT_TCPIP_ERROR;
        }
    }

    if ((res = nx_ip_fragment_enable(IP_HANDLE(iface_context->iface_type))) != NX_SUCCESS)
    {
        if (NX_ALREADY_ENABLED != res)
        {
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "error enable ip frag: %d\n", res);
            return CY_RSLT_TCPIP_ERROR;
        }
    }

#ifndef NX_DISABLE_IPV6
    cy_netxduo_autoipv6(iface_context);
#endif

#ifndef NX_DISABLE_IPV4
    if (iface_context->iface_type == CY_NETWORK_WIFI_STA_INTERFACE && wifi_sta_dhcp_needed)
    {
        if (dhcp_client_init(iface_context, whd_packet_pools) != CY_RSLT_SUCCESS)
        {
            return CY_RSLT_NETWORK_ERROR_STARTING_INTERNAL_DHCP;
        }

        /* Check for address resolution and wait for our addresses to be ready */
        res = nx_ip_status_check(IP_HANDLE(iface_context->iface_type), NX_IP_ADDRESS_RESOLVED, (ULONG *)&status, DHCP_IP_ADDRESS_RESOLUTION_TIMEOUT);
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "ip: %d status:%X\n", res, status);

        if (res == NX_SUCCESS)
        {
            ULONG ip;
            ULONG netmask;

            nx_ip_address_get(IP_HANDLE(iface_context->iface_type), &ip, &netmask);
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "=======================================\n");
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPv4: %u.%u.%u.%u  netmask: %u.%u.%u.%u\n", PRINT_HOST_IP(ip), PRINT_HOST_IP(netmask));

            /* Register a handler for any address changes */
            res = nx_ip_address_change_notify(IP_HANDLE(iface_context->iface_type), internal_ip_change_callback, iface_context);
            if (res != NX_SUCCESS)
            {
                wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "ip_change: %d\n", res);
                return CY_RSLT_TCPIP_ERROR;
            }
        }
        else
        {
            return CY_RSLT_TCPIP_ERROR;
        }
    }
    else if (iface_context->iface_type == CY_NETWORK_WIFI_AP_INTERFACE)
    {
        if (dhcp_server_init(iface_context, whd_packet_pools) != CY_RSLT_SUCCESS)
        {
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error starting DHCP server\n", res);
            return CY_RSLT_NETWORK_ERROR_STARTING_INTERNAL_DHCP;
        }
    }
#endif

    if (iface_context->iface_type == CY_NETWORK_WIFI_STA_INTERFACE)
    {
        /*
         * Start the DNS client.
         */

        res = dns_client_init(iface_context, whd_packet_pools);
        if (res == NX_SUCCESS && wifi_sta_dhcp_needed)
        {
            NXD_ADDRESS addr;
            UCHAR dns_ip[8];
            UINT size = sizeof(dns_ip);

