Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/netxduo-network-interface-integration/source/cy_netxduo.c
            /*
             * Get the DNS server address from DHCP.
             */

            res = nx_dhcp_interface_user_option_retrieve(&wifi_sta_dhcp_handle, 0, NX_DHCP_OPTION_DNS_SVR, dns_ip, &size);

            if (res == NX_SUCCESS)
            {
                addr.nxd_ip_version = NX_IP_VERSION_V4;
                addr.nxd_ip_address.v4 = *((ULONG *)dns_ip);
                if (cy_netxduo_add_dns_server(iface_context->iface_type, &addr) != CY_RSLT_SUCCESS)
                {
                    wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error adding DNS server\n");
                }
            }
        }
    }

    SET_IP_UP(iface_context->iface_type, true);

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_network_ip_down(cy_network_interface_context *iface_context)
{
    if (is_interface_valid(iface_context) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    if (!is_network_up(iface_context->iface_type))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Network is not UP\n");
        return CY_RSLT_NETWORK_INTERFACE_NETWORK_NOT_UP;
    }

    /*
     * Stop any network services that we started.
     */

    if (iface_context->iface_type == CY_NETWORK_WIFI_STA_INTERFACE && wifi_sta_dhcp_needed)
    {
        dhcp_client_deinit();

        dns_client_deinit();
    }

    if (iface_context->iface_type == CY_NETWORK_WIFI_AP_INTERFACE)
    {
        dhcp_server_deinit();
    }

    /*
     * Mark the network down.
     */

    SET_IP_UP(iface_context->iface_type, false);

    return CY_RSLT_SUCCESS;
}

void cy_network_register_ip_change_cb(cy_network_interface_context *iface_context, cy_network_ip_change_callback_t cb, void *userdata)
{
    ip_change_callback = cb;
}

/*
 * This functions helps to register/unregister callback for network activity
 */
void cy_network_activity_register_cb(cy_network_activity_event_callback_t cb)
{
    /* update the activity callback with the argument passed */
    activity_callback = cb;
}

/*
 * This function notifies network activity to LPA module.
 */
cy_rslt_t cy_network_activity_notify(cy_network_activity_type_t activity_type)
{
    if (activity_callback)
    {
        if (activity_type == CY_NETWORK_ACTIVITY_TX)
        {
            activity_callback(true);
        }
        else if (activity_type == CY_NETWORK_ACTIVITY_RX)
        {
            activity_callback(false);
        }
        else
        {
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid network activity type\n");
            return CY_RSLT_NETWORK_BAD_ARG;
        }
    }

    return CY_RSLT_SUCCESS;
}

#ifndef NX_DISABLE_IPV4
cy_rslt_t cy_network_dhcp_renew(cy_network_interface_context *iface_context)
{
    NX_DHCP *dhcp_handle = &wifi_sta_dhcp_handle;

    if (is_interface_valid(iface_context) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    /* Invalidate ARP entries */
    _nx_arp_interface_entries_delete(IP_HANDLE(iface_context->iface_type), 0);

    /* DHCP renewal*/
    nx_dhcp_force_renew(dhcp_handle);

    return CY_RSLT_SUCCESS;
}
#endif

/* Used to register callback for EAPOL packets */
cy_rslt_t cy_wifimwcore_eapol_register_receive_handler(cy_wifimwcore_eapol_packet_handler_t eapol_packet_handler)
{
    internal_eapol_packet_handler = eapol_packet_handler;
    return CY_RSLT_SUCCESS;
}

static void internal_ip_change_callback(NX_IP *netif, VOID *additional_info)
{
    /* notify wcm about ip change */
    if (ip_change_callback != NULL)
    {
        ip_change_callback(additional_info, NULL);
    }
}

static bool is_interface_added(cy_network_hw_interface_type_t iface_type)
{
    /*
     * If the WHD interface has been set for the
     * interface then we know that it's been added.
     */
    return ((GET_IP_NETWORK_WHD_IFACE(iface_type) != NULL));
}

static bool is_network_up(cy_network_hw_interface_type_t iface_type)
{
    return (ip_up[iface_type & 3]);
}

static cy_rslt_t is_interface_valid(cy_network_interface_context *iface)
{
    if ((iface == NULL) || iface->is_initialized == false)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t dhcp_client_init(cy_network_interface_context *iface, NX_PACKET_POOL *packet_pool)
{
    NX_IP       *ip_handle   = IP_HANDLE(iface->iface_type);
    NX_DHCP     *dhcp_handle = &wifi_sta_dhcp_handle;
    UINT        res;

    /* clear DHCP info to start */
    memset(dhcp_handle, 0, sizeof(*dhcp_handle));

    /* Create the DHCP instance. */
    res = nx_dhcp_create(dhcp_handle, ip_handle, "CY WHD");
    if (res != NX_SUCCESS)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "dhcp_create: 0x%02x\n", res);
        return CY_RSLT_TCPIP_ERROR;
    }

    nx_dhcp_packet_pool_set(dhcp_handle, packet_pool);

    /* Start DHCP. */
    res = nx_dhcp_start(dhcp_handle);
    if (res != NX_SUCCESS)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "dhcp_start: %d\n", res);
        return CY_RSLT_NETWORK_ERROR_STARTING_DHCP;
    }

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t dhcp_client_deinit(void)
{
    NX_DHCP *dhcp_handle = &wifi_sta_dhcp_handle;
    UINT     res;

    if (dhcp_handle->nx_dhcp_id != NX_DHCP_ID)
    {
        return CY_RSLT_SUCCESS;
    }

    res = nx_dhcp_stop(dhcp_handle);
    if ((res != NX_SUCCESS) && (res != NX_DHCP_NOT_STARTED))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_WARNING, "Failed to stop DHCP client\n");
     }

    nx_dhcp_delete(dhcp_handle);

    /* Clear the DHCP handle structure */
    memset(dhcp_handle, 0, sizeof(*dhcp_handle));

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t dhcp_server_init(cy_network_interface_context *iface, NX_PACKET_POOL *packet_pool)
{
    NX_IP *ip_handle = IP_HANDLE(iface->iface_type);
    NX_DHCP_SERVER *dhcp_handle = &wifi_ap_dhcp_handle;
    ULONG ip_addr;
    ULONG netmask;
    ULONG start_address;
    ULONG end_address;
    UINT addresses_added;
    UINT res;

    /* clear DHCP info to start */
    memset(dhcp_handle, 0, sizeof(*dhcp_handle));

