Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/netxduo-network-interface-integration/source/cy_netxduo.c
    /*
     * Get the IP address and netmask.
     */

    if (nx_ip_address_get(ip_handle, &ip_addr, &netmask) != NX_SUCCESS)
    {
        return CY_RSLT_NETWORK_ERROR_STARTING_INTERNAL_DHCP;
    }

    /*
     * Calculate the pool of addresses to use for the DHCP server.
     */

    start_address = ip_addr;
    if ((start_address & 0xFF) + DHCP_SERVER_MAX_NUM_CLIENTS > 0xFF)
    {
        /*
         * Not enough room for all the addresses.
         */

        return CY_RSLT_NETWORK_ERROR_STARTING_INTERNAL_DHCP;
    }
    start_address += 1;
    end_address = start_address + DHCP_SERVER_MAX_NUM_CLIENTS - 1;

    /* Create the DHCP Server.  */
    res = nx_dhcp_server_create(dhcp_handle, ip_handle, wifi_ap_dhcp_stack, NX_DHCP_SERVER_THREAD_STACK_SIZE, "CY DHCP Server", packet_pool);

    /* Check for errors creating the DHCP Server. */
    if (res != NX_SUCCESS)
    {
        return CY_RSLT_NETWORK_ERROR_STARTING_INTERNAL_DHCP;
    }

    /* Load the assignable DHCP IP addresses for the first interface.  */
    res = nx_dhcp_create_server_ip_address_list(dhcp_handle, 0, start_address, end_address, &addresses_added);

    /* Check for errors creating the list. */
    if (res != NX_SUCCESS)
    {
        return CY_RSLT_NETWORK_ERROR_STARTING_INTERNAL_DHCP;
    }

    /* Verify all the addresses were added to the list. */
    if (addresses_added != DHCP_SERVER_MAX_NUM_CLIENTS)
    {
        return CY_RSLT_NETWORK_ERROR_STARTING_INTERNAL_DHCP;
    }

    /*
     * Set the interface network parameters.
     * Use our address for the gateway and DNS server address.
     */

    res = nx_dhcp_set_interface_network_parameters(dhcp_handle, 0, netmask, ip_addr, ip_addr);

    /* Check for errors setting network parameters. */
    if (res != NX_SUCCESS)
    {
        return CY_RSLT_NETWORK_ERROR_STARTING_INTERNAL_DHCP;
    }

    /* Start DHCP Server task.  */
    res = nx_dhcp_server_start(dhcp_handle);
    if (res != NX_SUCCESS)
    {
        return CY_RSLT_NETWORK_ERROR_STARTING_INTERNAL_DHCP;
    }

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t dhcp_server_deinit(void)
{
    NX_DHCP_SERVER *dhcp_handle = &wifi_ap_dhcp_handle;
    UINT res;

    if (dhcp_handle->nx_dhcp_id != NX_DHCP_SERVER_ID)
    {
        return CY_RSLT_SUCCESS;
    }

    res = nx_dhcp_server_stop(dhcp_handle);
    if ((res != NX_SUCCESS) && (res != NX_DHCP_SERVER_NOT_STARTED))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_WARNING, "Failed to stop DHCP server\n");
     }

    nx_dhcp_server_delete(dhcp_handle);

    /* Clear the DHCP handle structure */
    memset(dhcp_handle, 0, sizeof(*dhcp_handle));

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t dns_client_init(cy_network_interface_context *iface, NX_PACKET_POOL *packet_pool)
{
    NX_IP       *ip_handle   = IP_HANDLE(iface->iface_type);
    NX_DNS      *dns_handle = &wifi_sta_dns_handle;
    UINT        res;

    /* clear DHCP info to start */
    memset(dns_handle, 0, sizeof(*dns_handle));

    res = nx_dns_create(dns_handle, ip_handle, (UCHAR *)"DNS Client");
    if (res != NX_SUCCESS)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "dns_create: 0x%02x\n", res);
        return CY_RSLT_NETWORK_ERROR_STARTING_DNS;
    }

#ifdef NX_DNS_CACHE_ENABLE
    res = nx_dns_cache_initialize(dns_handle, dns_local_cache, DNS_LOCAL_CACHE_SIZE);
    if (res != NX_SUCCESS)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to init DNS cache: 0x%02x\n", res);
    }
#endif

#ifdef NX_DNS_CLIENT_USER_CREATE_PACKET_POOL
    res = nx_dns_packet_pool_set(dns_handle, packet_pool);
    if (res != NX_SUCCESS)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "nx_dns_packet_pool_set: 0x%02x\n", res);
        nx_dns_delete(dns_handle);
        return CY_RSLT_NETWORK_ERROR_STARTING_DNS;
    }
#endif

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t dns_client_deinit(void)
{
    NX_DNS *dns_handle = &wifi_sta_dns_handle;

    if (dns_handle->nx_dns_id != NX_DNS_ID)
    {
        return CY_RSLT_SUCCESS;
    }

    nx_dns_delete(dns_handle);

    /* Clear the DNS handle structure */
    memset(dns_handle, 0, sizeof(*dns_handle));

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_netxduo_add_dns_server(cy_network_hw_interface_type_t iface_type, NXD_ADDRESS *dns_server_addr)
{
    NX_DNS      *dns_handle = &wifi_sta_dns_handle;
    UINT        res = NX_SUCCESS;

    /* Valid interface? */
    if (iface_type != CY_NETWORK_WIFI_STA_INTERFACE)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    /* Is DNS running and do we have a valid address pointer? */
    if (dns_handle->nx_dns_id != NX_DNS_ID || dns_server_addr == NULL)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    if (dns_server_addr->nxd_ip_version == NX_IP_VERSION_V4)
    {
        res = nx_dns_server_add(dns_handle, dns_server_addr->nxd_ip_address.v4);
    }
    else if (dns_server_addr->nxd_ip_version == NX_IP_VERSION_V6)
    {
        res = nxd_dns_server_add(dns_handle, dns_server_addr);
    }
    else
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error adding DNS server: 0x%02x\n", res);
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    if (res != NX_SUCCESS)
    {
        return CY_RSLT_NETWORK_ERROR_ADDING_DNS_SERVER;
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_network_get_hostbyname(cy_network_hw_interface_type_t iface_type, unsigned char *hostname, uint32_t lookup_type, uint32_t timeout, void *ipaddr)
{
    NX_DNS      *dns_handle = &wifi_sta_dns_handle;
    UINT        res = NX_SUCCESS;

    /* Valid interface? */
    if (iface_type != CY_NETWORK_WIFI_STA_INTERFACE)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    if ((lookup_type != NX_IP_VERSION_V4 && lookup_type != NX_IP_VERSION_V6) || ipaddr == NULL)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    res = nxd_dns_host_by_name_get(dns_handle, hostname, (NXD_ADDRESS *)ipaddr, NX_TIMEOUT(timeout), lookup_type);
    if (res != NX_SUCCESS)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error looking up addr for %s: 0x%02x\n", hostname, res);
        return CY_RSLT_TCPIP_ERROR;
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_network_get_packet_pool(cy_network_packet_dir_t direction, void **pool)
{
    if (pool == NULL)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

