Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/netxduo-network-interface-integration/source/cy_netxduo.c
    /*
     * Return the pool based on the direction.
     */

    if (direction == CY_NETWORK_PACKET_TX)
    {
        (*(NX_PACKET_POOL **)pool) = &whd_packet_pools[TX_PACKET_POOL];
    }
    else
    {
        (*(NX_PACKET_POOL **)pool) = &whd_packet_pools[RX_PACKET_POOL];
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_network_get_packet(cy_network_packet_type_t packet_type, uint32_t timeout, void **packet)
{
    NX_PACKET_POOL *pool;
    ULONG type;
    UINT status;

    if (packet == NULL)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    /*
     * What type of packet are we allocating?
     */

    switch (packet_type)
    {
        case CY_NETWORK_IP_PACKET:   type = NX_IP_PACKET;   break;
        case CY_NETWORK_TCP_PACKET:  type = NX_TCP_PACKET;  break;
        case CY_NETWORK_UDP_PACKET:  type = NX_UDP_PACKET;  break;
        case CY_NETWORK_ICMP_PACKET: type = NX_ICMP_PACKET; break;
        default:
            return CY_RSLT_NETWORK_BAD_ARG;
    }

    /*
     * Allocate from the TX packet pool
     */

    pool = &whd_packet_pools[TX_PACKET_POOL];

    /*
     * Get that packet.
     */

    status = nx_packet_allocate(pool, (NX_PACKET **)packet, type, NX_TIMEOUT(timeout));
    if (status != NX_SUCCESS)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to allocate packet: 0x%02x\n", status);
        return CY_RSLT_NETWORK_ERROR_NO_PACKET;
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_network_get_ip_address(cy_network_interface_context *iface_context, cy_nw_ip_address_t *ip_addr)
{
#ifndef NX_DISABLE_IPV4
    NX_IP *net_interface;
    ULONG ipv4_addr;
    ULONG netmask;

    if ((ip_addr == NULL) || (iface_context == NULL) ||
        ((iface_context->iface_type != CY_NETWORK_WIFI_STA_INTERFACE) && (iface_context->iface_type != CY_NETWORK_WIFI_AP_INTERFACE)))
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    memset(ip_addr, 0, sizeof(cy_nw_ip_address_t));
    net_interface = IP_HANDLE(iface_context->iface_type);
    if (nx_ip_address_get(net_interface, &ipv4_addr, &netmask) == NX_SUCCESS)
    {
        ip_addr->version = NW_IP_IPV4;
        ip_addr->ip.v4   = htonl(ipv4_addr);
    }
    else
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "IPV6 network not ready\n");
        return CY_RSLT_NETWORK_NO_INTERFACE_ADDRESS;
    }

    return CY_RSLT_SUCCESS;

#else
    /* IPV4 disabled */

    if (ip_addr == NULL)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERROR, "IPV4 is disabled\n");
    memset(ip_addr, 0, sizeof(cy_nw_ip_address_t));

    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

cy_rslt_t cy_network_get_ipv6_address(cy_network_interface_context *iface_context, cy_network_ipv6_type_t ipv6_addr_type, cy_nw_ip_address_t *ip_addr)
{
#ifndef NX_DISABLE_IPV6
    NX_IP *net_interface;
    NXD_ADDRESS ipv6_addr;
    UINT address_index;
    ULONG prefix_length;
    UINT interface_index;
#ifdef ENABLE_NETWORK_CORE_LOGS
    uint16_t *ipv6 = (uint16_t *)ipv6_addr.nxd_ip_address.v6;
#endif
    if ((ip_addr == NULL) || (iface_context == NULL) ||
        ((iface_context->iface_type != CY_NETWORK_WIFI_STA_INTERFACE) && (iface_context->iface_type != CY_NETWORK_WIFI_AP_INTERFACE)))
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    memset(ip_addr, 0, sizeof(cy_nw_ip_address_t));

    if (ipv6_addr_type != CY_NETWORK_IPV6_LINK_LOCAL)
    {
        /*TODO : Need to add support for Global IPV6 address */
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    address_index = 0;
    net_interface = IP_HANDLE(iface_context->iface_type);

    if (nxd_ipv6_address_get(net_interface, address_index, &ipv6_addr, &prefix_length, &interface_index) == NX_SUCCESS)
    {
        ip_addr->version = NW_IP_IPV6;
        ip_addr->ip.v6[0] = htonl(ipv6_addr.nxd_ip_address.v6[0]);
        ip_addr->ip.v6[1] = htonl(ipv6_addr.nxd_ip_address.v6[1]);
        ip_addr->ip.v6[2] = htonl(ipv6_addr.nxd_ip_address.v6[2]);
        ip_addr->ip.v6[3] = htonl(ipv6_addr.nxd_ip_address.v6[3]);

        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "IPV6 Address %.4X:%.4X:%.4X:%.4X:%.4X:%.4X:%.4X:%.4X assigned\n",
                      (unsigned int)(ipv6[1]), (unsigned int)(ipv6[0]), (unsigned int)(ipv6[3]),
                      (unsigned int)(ipv6[2]), (unsigned int)(ipv6[5]), (unsigned int)(ipv6[4]),
                      (unsigned int)(ipv6[7]), (unsigned int)(ipv6[6]));
    }
    else
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "IPV6 network not ready\n");
        return CY_RSLT_NETWORK_NO_INTERFACE_ADDRESS;
    }

    return CY_RSLT_SUCCESS;
#else
    /* IPV6 disabled */

    if (ip_addr == NULL)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERROR, "IPV6 is disabled\n");
    memset(ip_addr, 0, sizeof(cy_nw_ip_address_t));

    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

cy_rslt_t cy_network_get_gateway_ip_address(cy_network_interface_context *iface_context, cy_nw_ip_address_t *gateway_addr)
{
#ifndef NX_DISABLE_IPV4
    NX_IP *net_interface;
    ULONG ipv4_addr;

    if (gateway_addr == NULL)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }
    memset(gateway_addr, 0, sizeof(cy_nw_ip_address_t));

    net_interface = IP_HANDLE(iface_context->iface_type);
    if (nx_ip_gateway_address_get(net_interface, &ipv4_addr) == NX_SUCCESS)
    {
        gateway_addr->version = NW_IP_IPV4;
        gateway_addr->ip.v4   = htonl(ipv4_addr);
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Gateway IP Address %u.%u.%u.%u assigned\n", PRINT_HOST_IP(ipv4_addr));
        return CY_RSLT_SUCCESS;
    }
    else
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error retrieving gateway address\n");
        return CY_RSLT_NETWORK_GW_ADDRESS_NOT_FOUND;
    }

#else
    /* IPV4 disabled */

    if (gateway_addr == NULL)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERROR, "IPV4 is disabled\n");
    memset(gateway_addr, 0, sizeof(cy_nw_ip_address_t));

    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

cy_rslt_t cy_network_get_gateway_mac_address(cy_network_interface_context *iface_context, cy_nw_ip_mac_t *mac_addr)
{
#ifndef NX_DISABLE_IPV4
    UINT err;
    ULONG ipv4_addr;
    ULONG physical_msw;
    ULONG physical_lsw;
    int32_t arp_waittime = ARP_WAIT_TIME_IN_MSEC;
    NX_IP *net_interface;

