Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/netxduo-network-interface-integration/source/cy_netxduo.c
    if (mac_addr == NULL)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }
    memset(mac_addr, 0, sizeof(cy_nw_ip_mac_t));

    if (iface_context->iface_type == CY_NETWORK_WIFI_AP_INTERFACE)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "feature not supported for AP interface\n");
        return CY_RSLT_NETWORK_NOT_SUPPORTED;
    }

    net_interface = IP_HANDLE(CY_NETWORK_WIFI_STA_INTERFACE);
    if (net_interface == NULL)
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "network interface is NULL\n");
        return CY_RSLT_NETWORK_INTERFACE_DOES_NOT_EXIST;
    }

    nx_ip_gateway_address_get(net_interface, &ipv4_addr);

    if (nx_arp_hardware_address_find(net_interface, ipv4_addr, &physical_msw, &physical_lsw) != NX_SUCCESS)
    {
        /* Entry for the address is not present in the ARP cache. Sent ARP request.*/
        err = _nx_arp_dynamic_entry_set(net_interface, ipv4_addr, 0, 0);
        if (err != NX_SUCCESS)
        {
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "_nx_arp_packet_send failed with error 0x%02x\n", err);
            return CY_RSLT_NETWORK_ARP_REQUEST_FAILURE;
        }

        do
        {
            if (nx_arp_hardware_address_find(net_interface, ipv4_addr, &physical_msw, &physical_lsw) == NX_SUCCESS)
            {
                wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "arp entry found\n");
                break;
            }
            cy_rtos_delay_milliseconds(ARP_CACHE_CHECK_INTERVAL_IN_MSEC);
            arp_waittime -= ARP_CACHE_CHECK_INTERVAL_IN_MSEC;
            if (arp_waittime <= 0)
            {
                wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Could not resolve MAC address for the given destination address\n");
                return CY_RSLT_NETWORK_WAIT_TIMEOUT;
            }
        } while(1);
    }


    mac_addr->mac[0] = (uint8_t)((physical_msw >>  8) & 0xFF);
    mac_addr->mac[1] = (uint8_t)((physical_msw >>  0) & 0xFF);
    mac_addr->mac[2] = (uint8_t)((physical_lsw >> 24) & 0xFF);
    mac_addr->mac[3] = (uint8_t)((physical_lsw >> 16) & 0xFF);
    mac_addr->mac[4] = (uint8_t)((physical_lsw >>  8) & 0xFF);
    mac_addr->mac[5] = (uint8_t)((physical_lsw >>  0) & 0xFF);

    return CY_RSLT_SUCCESS;
#else
    /* IPV4 disabled */

    if (mac_addr == NULL)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERROR, "IPV4 is disabled\n");
    memset(mac_addr, 0, sizeof(mac_addr));

    return CY_RSLT_NETXDUO_BAD_ARG;
#endif
}


cy_rslt_t cy_network_get_netmask_address(cy_network_interface_context *iface_context, cy_nw_ip_address_t *net_mask_addr)
{
#ifndef NX_DISABLE_IPV4
    NX_IP *net_interface;
    ULONG ipv4_addr;
    ULONG netmask;

    if ((net_mask_addr == NULL) || (iface_context == NULL) ||
        ((iface_context->iface_type != CY_NETWORK_WIFI_STA_INTERFACE) && (iface_context->iface_type != CY_NETWORK_WIFI_AP_INTERFACE)))
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    memset(net_mask_addr, 0, sizeof(cy_nw_ip_address_t));
    net_interface = IP_HANDLE(iface_context->iface_type);
    nx_ip_address_get(net_interface, &ipv4_addr, &netmask);

    net_mask_addr->version = NW_IP_IPV4;
    net_mask_addr->ip.v4   = htonl(netmask);

    return CY_RSLT_SUCCESS;

#else
    /* IPV4 disabled */

    if (net_mask_addr == NULL)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERROR, "IPV4 is disabled\n");
    memset(net_mask_addr, 0, sizeof(cy_nw_ip_address_t));

    return CY_RSLT_NETWORK_NOT_SUPPORTED;
#endif
}

cy_rslt_t cy_network_ping(cy_network_interface_context *iface_context, cy_nw_ip_address_t *address, uint32_t timeout_ms, uint32_t* elapsed_time_ms)
{
#ifndef NX_DISABLE_IPV4
    cy_time_t send_time;
    cy_time_t recvd_time;
    UINT err;
    NX_IP *net_interface;
    NX_PACKET *response_ptr;

    if((address == NULL) || (elapsed_time_ms == NULL))
    {
        wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "BAD arguments \r\n");
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    /*
     * Make sure we aren't going to wait forever.
     */

    if (timeout_ms == TX_WAIT_FOREVER)
    {
        timeout_ms = TX_WAIT_FOREVER - 1;
    }
    net_interface = iface_context->nw_interface;

    /* Record time ping was sent */
    cy_rtos_get_time(&send_time);

    /* Send the ping */
    err = nx_icmp_ping(net_interface, ntohl(address->ip.v4), "abcd", 4, &response_ptr, timeout_ms);
    if (err != NX_SUCCESS)
    {
        return CY_RSLT_NETWORK_PING_FAILURE;
    }

    /* compute the elapsed time since a ping request was initiated */
    cy_rtos_get_time(&recvd_time);
    *elapsed_time_ms = (uint32_t)(recvd_time - send_time);

    /*
     * Don't forget to release the packet.
     */

    nx_packet_release(response_ptr);

    return CY_RSLT_SUCCESS;
#else
    /* IPV4 disabled */

    if (address == NULL || elapsed_time_ms)
    {
        return CY_RSLT_NETWORK_BAD_ARG;
    }

    memset(address, 0, sizeof(*address));
    memset(elapsed_time_ms, 0, sizeof(*elapsed_time_ms));

    return CY_RSLT_NETWORK_PING_FAILURE;
#endif
}
cy_rslt_t cy_network_deinit(void)
{
    return CY_RSLT_SUCCESS;
}
